{
  "backend/main.mo": "Motoko backend handling user profiles and per‑user health logs with access control and CRUD query/update methods.",
  "feature_evidence.json": "Feature evidence report mapping features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten descriptions summarizing major frontend files and their roles.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "Minimal HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app routing between pages, managing auth, profile loading, and theme provider.",
  "frontend/src/components/AppHeader.tsx": "Header with logo, navigation buttons, and auth controls that adapt to signed‑in state.",
  "frontend/src/components/AuthButton.tsx": "Internet Identity login/logout button with loading handling and query cache resets.",
  "frontend/src/components/HealthLogComposer.tsx": "Form component for submitting mood, sleep hours, and notes to create a health log entry.",
  "frontend/src/components/HealthLogList.tsx": "Displays recent health log entries with mood, sleep, notes, and handles loading and error states.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name, age range, and health goals, submitting via a save-profile hook.",
  "frontend/src/components/SignedInBadge.tsx": "Shows a badge with the user’s name or shortened principal when authenticated.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useHealthLog.ts": "Hooks to fetch and create health log entries using the actor and react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login, logout, and identity loading via a React context.",
  "frontend/src/hooks/useProfile.ts": "Hooks for loading and saving the current user profile through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with profile editing, health log creation, and log list display using various UI components and hooks.",
  "frontend/src/pages/FutureAiInsightsPage.tsx": "Displays a coming-soon page outlining planned AI wellness insight features with informational cards and a disclaimer.",
  "frontend/src/pages/LandingPage.tsx": "Shows the marketing landing page with hero content, feature highlights, and navigation buttons to dashboard or insights.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom colors, fonts, shadows, animations, and extended theme settings.",
  "project_state.json": "Defines the VitaSense project state, including schema version, planned features, image requirements, and current UI/UX and backend capability goals. Lists all existing feature definitions and their requirement IDs for build planning."
}