{
  "backend/main.mo": "Main actor implementing Digital Detox app with user profiles, challenges, focus sessions, screen time tracking, and authorization. Includes CRUD operations for profiles, challenges, focus sessions, and points/streak management.",
  "backend/migration.mo": "Migration module defining old and new actor schemas for transitioning from health-focused profiles to Digital Detox user profiles with challenges, focus sessions, and gamification features.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including onboarding flow, dashboard, focus mode, challenges system, statistics, rewards, AI assistant, and settings with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON summary of frontend files describing components, pages, hooks, and styling for the Digital Detox application with wellness-themed design system.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes using warm wellness palette (sage green primary, warm neutrals).",
  "frontend/index.html": "HTML entry point for VitaSense application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component managing authentication, view routing between 8 pages, onboarding flow display logic, and theme provider setup with bottom navigation.",
  "frontend/src/components/AiSuggestions.tsx": "Component displaying AI-generated personalized suggestions based on user patterns and focus sessions with categorized icons and warning highlights.",
  "frontend/src/components/AppHeader.tsx": "Sticky header with app logo, navigation menu for authenticated users (Dashboard, Focus, Challenges, Statistics), signed-in badge, and auth button.",
  "frontend/src/components/AuthButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/BadgeCollection.tsx": "Displays a grid of achievement badges with locked/unlocked states based on user profile gamification data.",
  "frontend/src/components/BottomNavigation.tsx": "Mobile-only bottom navigation bar with five tabs (Home, Focus, Challenges, Stats, Settings) for view switching.",
  "frontend/src/components/ChallengeCard.tsx": "Card component displaying challenge details with progress tracking for active challenges or a join button for prebuilt challenges.",
  "frontend/src/components/CustomChallengeDialog.tsx": "Modal dialog form for creating custom digital detox challenges with name, description, and duration inputs.",
  "frontend/src/components/DashboardStats.tsx": "Dashboard widget displaying three key metrics: current streak, total points, and user level in card format.",
  "frontend/src/components/DataResetDialog.tsx": "Confirmation dialog for resetting all user data including focus sessions, challenges, streak, points, and level.",
  "frontend/src/components/ExitWarningDialog.tsx": "Alert dialog that warns users about losing points when exiting an active focus session early.",
  "frontend/src/components/FocusHoursChart.tsx": "Line chart component visualizing focus hours over daily, weekly, or monthly time ranges using Recharts.",
  "frontend/src/components/FocusTimer.tsx": "Countdown timer with circular progress visualization for focus sessions, including pause/resume controls and completion handling with points rewards.",
  "frontend/src/components/HealthLogComposer.tsx": "Empty file with no content.",
  "frontend/src/components/HealthLogList.tsx": "Empty file with no content.",
  "frontend/src/components/LevelProgressTracker.tsx": "Displays user's current level, total points, and progress toward the next level with a visual progress bar and grid of unlockable level badges (Beginner, Consistent, Focused Mind, Digital Master).",
  "frontend/src/components/MotivationalQuote.tsx": "Shows a daily motivational quote from a predefined list, rotating based on the day of the year to encourage digital wellness habits.",
  "frontend/src/components/OnboardingFlow.tsx": "Multi-step onboarding wizard that collects user information (name, email, screen time goals, daily limits, focus duration) and creates an initial user profile with beginner level status.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for initial profile creation that collects user's name, optional email, and health goals, then saves a new beginner-level profile to the backend.",
  "frontend/src/components/ReminderSettings.tsx": "Manages notification preferences including screen time warnings and nighttime disconnect reminders, requesting browser notification permissions and persisting settings to localStorage.",
  "frontend/src/components/ScreenTimeChart.tsx": "Renders a bar chart visualization comparing screen time usage against daily limits across daily, weekly, or monthly time ranges using Recharts library.",
  "frontend/src/components/ScreenTimeProgress.tsx": "Displays current daily screen time usage as a progress bar with remaining time, showing color-coded status (green/yellow/red) based on percentage of daily limit consumed.",
  "frontend/src/components/SignedInBadge.tsx": "Shows a badge with the signed-in user's name or truncated principal ID when authenticated via Internet Identity.",
  "frontend/src/components/StreakHistory.tsx": "Visualizes the user's consistency streak with a large streak number and a 30-day calendar grid showing active days in accent color.",
  "frontend/src/components/SuccessAnimation.tsx": "Displays a full-screen success celebration card with animated sparkles, a success image, and earned points after completing a focus session.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useHealthLog.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useProfile.ts": "Provides React Query hooks for fetching and saving the current user's profile (DigitalDetoxUser) via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Comprehensive React Query hooks for all backend operations including user profiles, challenges, focus sessions, and points management with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a calm blue and soft purple color theme for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AssistantPage.tsx": "Page displaying AI-powered personalized insights and suggestions based on user profile and focus session patterns.",
  "frontend/src/pages/ChallengesPage.tsx": "Page showing pre-built and active user challenges with options to create custom challenges, displaying challenge cards in a responsive grid layout.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying user welcome message, motivational quote, stats overview, screen time progress, quick action cards for focus sessions and challenges, and current streak display.",
  "frontend/src/pages/FocusModePage.tsx": "Focus mode page allowing users to select preset durations (25/45/60 min) or custom duration (1-180 min) to start a timed focus session with FocusTimer component.",
  "frontend/src/pages/FutureAiInsightsPage.tsx": "Empty placeholder file for future AI insights functionality.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, features grid showcasing focus sessions/challenges/rewards/analytics, and call-to-action to start the digital detox journey.",
  "frontend/src/pages/RewardsPage.tsx": "Rewards page displaying user's level progress tracker and badge collection achievements.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page for managing daily screen time limit, theme (light/dark), reminders, data reset, and logout functionality.",
  "frontend/src/pages/StatisticsPage.tsx": "Statistics page with tabbed time range views (daily/weekly/monthly) showing screen time charts, focus hours charts, streak history, and overall progress metrics.",
  "frontend/src/utils/aiAnalysis.ts": "Utility function that analyzes user patterns from profile and focus sessions to generate personalized suggestions for screen time warnings, focus time optimization, streak encouragement, and detox tips.",
  "frontend/src/utils/gamification.ts": "Defines gamification logic including level progression (Beginner to Digital Master with point thresholds) and badge system that tracks user achievements based on points, streaks, sessions, and challenges completed.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme with OKLCH color system, extended font families (Poppins/Inter), custom border radii, shadows, animations, and sidebar/chart color tokens.",
  "project_state.json": "Project metadata for a Digital Detox mobile app tracking existing features like onboarding flow, home dashboard, focus mode, challenges system, and statistics/analytics with Firebase backend architecture."
}