{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Digital Detox Mobile App - Frontend Implementation",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Create multi-step onboarding flow collecting screen time data, distraction apps, goals, and preferences",
      "acceptanceCriteria": [
        "Multi-step onboarding form with progress indicator",
        "All fields validated before submission",
        "Data saved to backend on completion",
        "Onboarding only shown once per user"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OnboardingFlow.tsx",
          "operation": "create",
          "description": "Create multi-step onboarding component with steps for: welcome screen with calming animation, average daily screen time input, biggest distraction apps text input, main goal dropdown (Reduce addiction/Improve focus/Sleep better), daily screen time limit input, and preferred focus duration selection. Include progress indicator and form validation. Wire the generated image frontend/public/assets/generated/welcome-hero.dim_800x600.png as the welcome screen background. Use authorization component to ensure authenticated users complete onboarding."
        },
        {
          "path": "frontend/src/hooks/useOnboarding.ts",
          "operation": "create",
          "description": "Create hook to check if user has completed onboarding (by checking if profile exists with required fields), submit onboarding data by calling saveCallerUserProfile, and manage onboarding state. Use the authorization component's getCallerUserProfile to verify completion status."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add onboarding route guard that shows OnboardingFlow component when user is authenticated but hasn't completed onboarding. After onboarding completion, redirect to dashboard. Use the authorization component's authentication state to gate access."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Build home dashboard with screen time tracking, progress visualization, streak counter, motivational quotes, and action buttons",
      "acceptanceCriteria": [
        "Dashboard displays real-time screen time data",
        "Progress bar accurately reflects time used vs. limit",
        "Motivational quote updates daily",
        "Buttons navigate to respective features"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Replace health-focused dashboard with Digital Detox dashboard showing: today's screen time (from currentScreenTime), remaining allowed time (dailyLimit - currentScreenTime), progress bar visualization, current streak count, dynamic motivational quote that changes daily, 'Start Focus Session' button linking to focus mode, and 'Join Challenge' button linking to challenges. Fetch user data via getCallerUserProfile from the authorization component."
        },
        {
          "path": "frontend/src/components/ScreenTimeProgress.tsx",
          "operation": "create",
          "description": "Create progress bar component that visualizes screen time used vs daily limit with percentage calculation and color-coded states (safe/warning/exceeded). Apply calm blue and soft purple theme colors."
        },
        {
          "path": "frontend/src/components/MotivationalQuote.tsx",
          "operation": "create",
          "description": "Create component displaying daily motivational quotes that change based on current date. Include a curated list of mindfulness and digital wellness quotes."
        },
        {
          "path": "frontend/src/components/DashboardStats.tsx",
          "operation": "create",
          "description": "Create stats overview component displaying today's screen time, remaining time, and current streak with soft rounded cards and calm color palette."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Implement Focus Mode with timer options, countdown animation, exit warning, and completion rewards",
      "acceptanceCriteria": [
        "Timer displays countdown with visual animation",
        "Custom timer accepts user input in minutes",
        "Exit warning appears when attempting early exit",
        "Completion triggers point award and streak increment",
        "Success animation plays on session completion"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FocusModePage.tsx",
          "operation": "create",
          "description": "Create Focus Mode page with timer options (25 min, 45 min, Custom), countdown animation with circular progress indicator, exit warning popup using dialog component, and on completion: call saveFocusSession and addPoints backend capabilities, show success animation using frontend/public/assets/generated/success-celebration.dim_400x400.png, and increment streak. Apply calm blue and soft purple theme."
        },
        {
          "path": "frontend/src/components/FocusTimer.tsx",
          "operation": "create",
          "description": "Create countdown timer component with circular animated progress ring, minutes:seconds display, pause/resume controls, and smooth transitions. Style with dark mode theme and minimal animations."
        },
        {
          "path": "frontend/src/components/ExitWarningDialog.tsx",
          "operation": "create",
          "description": "Create dialog component warning user about exiting focus session early, with options to continue session or exit anyway. Use shadcn/ui Dialog component."
        },
        {
          "path": "frontend/src/components/SuccessAnimation.tsx",
          "operation": "create",
          "description": "Create success celebration component displaying the generated image frontend/public/assets/generated/success-celebration.dim_400x400.png with fade-in animation and confetti effect. Show points earned and streak increment."
        },
        {
          "path": "frontend/src/hooks/useFocusSession.ts",
          "operation": "create",
          "description": "Create hook managing focus session state, calling saveFocusSession backend capability on completion, awarding points via addPoints, and handling timer logic. Verify the authorization component's usage instructions before implementing authentication checks."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for /focus-mode page and wire FocusModePage component into the router. Ensure route is protected by authentication guard."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Create Digital Detox Challenges system with pre-built and custom challenges, progress tracking, and rewards",
      "acceptanceCriteria": [
        "Pre-built challenges available in a list",
        "Users can join and leave challenges",
        "Daily progress tracked and displayed",
        "Completion percentage calculated accurately",
        "Bonus points awarded on challenge completion",
        "Custom challenge creation with name, duration, and rules"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ChallengesPage.tsx",
          "operation": "create",
          "description": "Create Challenges page displaying pre-built challenges (7-Day Detox, No Social Media Sunday, 2 Hours No Phone Before Sleep) and custom challenge option. Show active challenges with completion percentage and daily progress tracking. Allow joining/leaving challenges via createChallenge backend capability. Award bonus points on completion via addPoints."
        },
        {
          "path": "frontend/src/components/ChallengeCard.tsx",
          "operation": "create",
          "description": "Create challenge card component showing challenge name, description, progress bar, completion percentage, start/end dates, and join/leave action button. Style with soft rounded cards and calm color palette."
        },
        {
          "path": "frontend/src/components/CustomChallengeDialog.tsx",
          "operation": "create",
          "description": "Create dialog for creating custom challenges with fields for name, description, start date, end date, and challenge rules. Submit via createChallenge backend capability. Use shadcn/ui Dialog component."
        },
        {
          "path": "frontend/src/hooks/useChallenges.ts",
          "operation": "create",
          "description": "Create hook to fetch challenges via getChallengeProgress, create challenges via createChallenge, update progress via updateChallengeProgress, and calculate completion percentages. Handle authentication using the authorization component."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for /challenges page and wire ChallengesPage component into the router with authentication guard."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Build Statistics & Analytics page with daily/weekly/monthly charts for screen time, focus hours, and streak history",
      "acceptanceCriteria": [
        "Toggle between daily, weekly, and monthly views",
        "Charts display screen time trends",
        "Focus hours aggregated and visualized",
        "Streak history shown with dates",
        "Improvement percentage calculated from baseline"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StatisticsPage.tsx",
          "operation": "create",
          "description": "Create Statistics & Analytics page with view toggle (daily/weekly/monthly), charts for screen time comparison, focus hours tracked via getFocusSessions, streak history, and improvement percentage over time. Use chart library compatible with React and Tailwind."
        },
        {
          "path": "frontend/src/components/ScreenTimeChart.tsx",
          "operation": "create",
          "description": "Create chart component visualizing screen time trends over selected time period with line or bar chart. Style with calm blue and soft purple theme."
        },
        {
          "path": "frontend/src/components/FocusHoursChart.tsx",
          "operation": "create",
          "description": "Create chart component showing focus session hours aggregated by day/week/month using data from getFocusSessions backend capability."
        },
        {
          "path": "frontend/src/components/StreakHistory.tsx",
          "operation": "create",
          "description": "Create component displaying streak history with dates and visual streak calendar. Show current streak prominently."
        },
        {
          "path": "frontend/src/hooks/useStatistics.ts",
          "operation": "create",
          "description": "Create hook to aggregate and calculate statistics from user profile data, focus sessions, and screen time history. Handle date range filtering for daily/weekly/monthly views."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for /statistics page and wire StatisticsPage component into the router with authentication guard."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Implement rewards and gamification with points, level progression, badges, and visual progress tracker",
      "acceptanceCriteria": [
        "Points awarded for completing focus sessions and challenges",
        "Level thresholds defined for each tier",
        "Badges unlock based on achievements",
        "Progress tracker shows current level and next milestone",
        "Level-up animation displays on progression"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LevelProgressTracker.tsx",
          "operation": "create",
          "description": "Create visual progress tracker showing current level (Beginner/Consistent/Focused Mind/Digital Master), total points, and progress bar to next level. Display level-up animation when progression occurs using frontend/public/assets/generated/success-celebration.dim_400x400.png."
        },
        {
          "path": "frontend/src/components/BadgeCollection.tsx",
          "operation": "create",
          "description": "Create badge collection component displaying unlocked and locked badges with achievement criteria. Style with soft rounded cards and calm color palette."
        },
        {
          "path": "frontend/src/pages/RewardsPage.tsx",
          "operation": "create",
          "description": "Create Rewards page showing LevelProgressTracker, BadgeCollection, points history, and gamification overview. Fetch user level and totalPoints from getCallerUserProfile."
        },
        {
          "path": "frontend/src/utils/gamification.ts",
          "operation": "create",
          "description": "Create utility functions for level thresholds, badge unlock logic, points calculation for different activities, and level progression checks."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for /rewards page and wire RewardsPage component into the router with authentication guard."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Create AI Smart Assistant providing personalized suggestions based on usage patterns",
      "acceptanceCriteria": [
        "AI suggestions based on historical usage data",
        "Recommendations update daily",
        "Tips displayed in a dedicated assistant section",
        "Notifications sent at optimal times based on user patterns"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AssistantPage.tsx",
          "operation": "create",
          "description": "Create AI Smart Assistant page analyzing user patterns from focus sessions and screen time to provide personalized suggestions including: best focus time recommendations, detox tips, app usage warnings, and daily personalized insights. Use local analysis of user data fetched via getCallerUserProfile and getFocusSessions."
        },
        {
          "path": "frontend/src/components/AiSuggestions.tsx",
          "operation": "create",
          "description": "Create component displaying personalized AI suggestions in card format with icons, categorized by type (focus time, detox tips, warnings). Style with soft rounded cards and calm color palette."
        },
        {
          "path": "frontend/src/utils/aiAnalysis.ts",
          "operation": "create",
          "description": "Create utility functions to analyze user patterns (best focus times based on completed sessions, usage warnings based on screen time trends, personalized detox tips based on goals) using client-side logic."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for /assistant page and wire AssistantPage component into the router with authentication guard."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Build reminder system for screen time limits, nighttime disconnect, and custom scheduling",
      "acceptanceCriteria": [
        "Notification triggers at 80% of daily limit",
        "Nighttime reminder sent at user-configured time",
        "Custom reminders can be added with time and message",
        "Reminder preferences saved to user profile"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ReminderSettings.tsx",
          "operation": "create",
          "description": "Create reminder configuration component for setting nighttime disconnect time, enabling/disabling screen time limit warnings (at 80% threshold), and adding custom reminders with time and message. Store preferences in local storage since real-time push notifications are not supported."
        },
        {
          "path": "frontend/src/hooks/useReminders.ts",
          "operation": "create",
          "description": "Create hook managing reminder scheduling logic, checking current screen time against daily limit to trigger 80% warning, scheduling nighttime reminders, and handling custom reminder timers using browser Notification API with user permission."
        },
        {
          "path": "frontend/src/utils/notifications.ts",
          "operation": "create",
          "description": "Create utility functions for browser notification permission handling, notification display with calm messaging (e.g., 'Time to disconnect 🌙'), and reminder scheduling logic."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Create Settings page with screen time limit editing, theme control, notifications, data reset, and logout",
      "acceptanceCriteria": [
        "Screen limit editable with validation",
        "Theme toggle switches between light and dark modes",
        "Notification settings persist across sessions",
        "Data reset confirms before clearing all user data",
        "Logout clears session and returns to landing page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "create",
          "description": "Create Settings page with sections for: editing daily screen time limit (with validation), theme toggle (dark mode default), notification preferences using ReminderSettings component, data reset button with confirmation dialog, and logout button. Update profile via saveCallerUserProfile and use authorization component's clear function for logout."
        },
        {
          "path": "frontend/src/components/DataResetDialog.tsx",
          "operation": "create",
          "description": "Create confirmation dialog for data reset warning user about permanent deletion. On confirm, clear all user data by calling saveCallerUserProfile with reset values. Use shadcn/ui Dialog component."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for /settings page and wire SettingsPage component into the router with authentication guard."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Apply cohesive visual design with calm blue/purple dark mode theme, minimalistic layout, smooth animations, and clean navigation",
      "acceptanceCriteria": [
        "Dark mode is the default theme",
        "Blue and purple accent colors used consistently",
        "All cards have rounded corners",
        "Transitions animate smoothly between states",
        "Typography is clear and modern",
        "Bottom navigation provides quick access to main sections"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global styles to use calm blue and soft purple color palette as default dark mode theme. Define OKLCH color tokens for primary blues, accent purples, and neutral grays. Set dark mode as default theme. Add smooth transition utilities and rounded card styles."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Configure Tailwind with custom calm blue and soft purple colors, default dark mode, modern typography stack, rounded corners (xl/2xl), smooth transition timings, and minimal animation utilities."
        },
        {
          "path": "frontend/src/components/BottomNavigation.tsx",
          "operation": "create",
          "description": "Create clean bottom navigation bar with icons and labels for main sections: Dashboard, Focus, Challenges, Statistics, and Settings. Style with calm color palette, smooth transitions, and active state indicators. Apply soft rounded design."
        },
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Update header to use the generated app icon frontend/public/assets/generated/app-icon.dim_512x512.png as logo, apply calm blue and purple theme colors, and ensure minimal design with smooth transitions. Replace existing health-focused branding."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire BottomNavigation component into the app layout for authenticated users. Ensure it appears on all main pages (Dashboard, Focus, Challenges, Statistics, Settings) but not on onboarding or landing page."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Update landing page to feature Digital Detox app with hero section using frontend/public/assets/generated/welcome-hero.dim_800x600.png, calm blue and purple theme, feature highlights (focus tracking, challenges, gamification), and navigation to dashboard. Replace existing health-focused content."
        }
      ]
    }
  ]
}